<template>
  <div id="app">
    <router-view/>
  </div>
</template>

<script>
export default {
  name: 'musicApp',
  mounted () {
    this.info()
  },
  methods: {
    info () {
      const h = this.$createElement
      this.$info({
        title: '蓝眼音乐',
        content: h('div', {}, [
          h('h1', '产品说明'),
          h('div', '1.本网站是一个面向用户的C端网站，不是XXX管理系统'),
          h('div', '2.本网站模拟网易云音乐搭建，若有条件请打开网易云客户端对照使用'),
          h('div', '3.由于时间有限且只有一名开发，本网站当前只完成部分核心功能,完成度还很低，如果遇到按钮点不动或者其他问题是正常现象，请见谅'),
          h('div', '4.当前登录只是根据uid拉取用户数据，并不是真正的登录，后续实现真正的输入密码的登录'),
          h('div', '5.如果遇到音乐无法播放，表明此首歌是vip或者无版权，请切换其他歌，推荐林俊杰，邓紫棋等拥有版权的歌手的歌'),
          h('div', '6.目前可以使用的栏目有发现音乐下的（个人推荐，歌单，歌手），其他的仍在开发中'),
          h('div', '7.底部的小播放器左边图片可以点击切换为大播放器！！！'),
          h('div', '8.部分图标较丑或不适合当前使用场景，是因为还没有来得及换，请见谅'),
          h('h1', '技术亮点'),
          h('div', '1.歌词的解析'),
          h('div', '2.精准歌词的实现，但目前存在部分问题，后续优化'),
          h('div', '3.歌手过滤器及歌单过滤器的实现'),
          h('div', '4.其他'),
          h('h1', '注意事项'),
          h('div', '1.本网站使用大量h5新特性，ie兼容性较差，后期优化，所以为了保证体验请使用chrome或者firefox等现代浏览器访问'),
          h('div', '2.目前完成的功能有(个性化推荐，歌单，歌手,搜索，登录及核心的音乐播放)，但存在部分问题，后续添加新的功能(榜单，MV, 真正的登录等)及完善已有的功能'),
          h('div', '3.本网站全部数据均来自网易云音乐，仅供学习使用')
        ]),
        onOk () {}
      })
    }
  }
}
</script>
<style lang="less">
@import "styles/index.less";
#app {
  height: 100%;
  background: var(--body-bg-color--);
}
</style>
